{
 "characters": [
  {
   "name": "Goku",
   "image": "goku.png",
   "summary": "Son Goku (孫そん悟ご空くう Son Gokū), born Kakarot (カカロット Kakarotto), is the main protagonist of the Dragon Ball metaseries. Goku is a Saiyan male originally sent to destroy Earth as an infant. However, a head injury at an early age alters his memory, ridding him of his initial destructive nature and allowing him to grow up to become one of Earth's greatest defenders. He constantly strives and trains to be the greatest warrior possible, which has kept the Earth and the universe safe from destruction many times. Goku is one of the strongest mortal warriors in the multiverse, often referred to (including by deities) as the most powerful and fittest warrior in Universe 7, as well as a one of the most powerful characters in the franchise. A prodigy of combat, he learned a great deal while a young child and would continue to near-effortlessly learn practically any new technique he encountered. His natural talent for battle along with his unwavering drive have taken his power to unprecedented levels to the point of reaching and rivaling the domain of the Gods of Destruction. Ultimately, Goku's immeasurable potential has made him believed to be incomparable and even unbeatable for any other fighter when he is at his absolute peak.",
   "rank": "Mastered Ultra Instinct",
   "rank_url": "https://dragonballuniverse.fandom.com/wiki/Ultra_Instinct",
   "moves": [
     "Kamehameha",
     "Kaio-ken",
      "Spirit Bomb",
      "Instant Transmission",
      "Evil Containment Wave",
      "Autonomous Ultra Instinct",
      "Dragon Fist"
    ],
   "fighting_style": "Goku's signature move since obtaining it is the Kamehameha. It unleashes a powerful and long-stretching blue energy blast from his cupped hands. Goku first learns the move as a kid after witnessing Master Roshi using it. It can be charged to compete with practically any enemy attack. Since mastering this technique, Goku has continued to improve on it and develop new variations of it. The art of automatic self-movement, Goku began learning this from Whis. During the Tournament of Power, Goku unlocked a special state, enabling him to put to usage this skill. While very crude at first and only able to apply it defensively, he ultimately learned to complete this power to defend and attack simultaneously with optimum efficiency. With this power, he is able to instinctively and instantly react to any nearby threat in the most effective way possible."
  },
  {
   "name": "Vegeta",
   "image": "vegeta.png",
   "summary": "Vegeta (ベジータ Bejīta), more specifically Vegeta IV (ベジータ四世 Bejīta Yonsei)[6], recognized as Prince Vegeta (ベジータ王子 Bejīta Ōji) is the prince of the fallen Saiyan race and one of the main characters of the Dragon Ball series. Regal, egotistical, and full of pride, Vegeta was once a ruthless, cold-blooded warrior and outright killer,[7] but later abandons his role in the Frieza Force, instead opting to remain and live on Earth. His character evolves from villain, to anti-hero, then to hero through the course of the series, repeatedly fighting alongside the universe's most powerful warriors in order to protect his new home and surpass Goku in power.",
   "rank": "Super Saiyan Blue Evolution Shinka Enraged",
   "rank_url": "https://dragonball.fandom.com/wiki/Super_Saiyan_God_SS_Evolved",
   "moves": [
     "Galick Gun",
     "Lucora Gun",
      "Big Bang Attack",
      "Final Flash",
      "Final Impact",
      "Gamma Burst Flash",
      "Spirit Control",
      "Hakai"
    ],
   "fighting_style": "It's all about winning with this guy. A good example would be his techniques - he doesn't try to use innovative and complex techniques like Goku and Piccolo, instead he's pretty much about blowing shit up with large and/or numerous Ki blasts. He rarely even goes to a fighting stance to show his confidence. He mostly uses single, powerful straight punches, kicks, headbutts, knees and elbows, targeting the face and gut/solar plexus most of the time. He also ocassionaly throws the opponent by the arm."
  },
  {
   "name": "Android 18",
   "image": "android18-main2.png",
   "summary": "Android 18 (人造人間１８号 Jinzōningen Jū Hachi-Gō, lit. Artificial Human No. 18), originally named Lazuli (ラズリ Razuri) when she was an ordinary human, is the twin sister of Android 17 and Dr. Gero's eighteenth android creation, designed to serve Gero's vendetta against Goku. Like her brother, Android 18 usually displays a cool and confident character, especially in battle, although her sarcastic humor is the most prominent trait of her personality.",
   "rank": "450,000,000 - 900,000,000 power level",
   "rank_url": "https://dragonball.fandom.com/wiki/User_blog:SpikeFuture/All_Dragon_Ball_Power_Levels",
   "moves": [
      "Flight",
      "Energy Attack",
      "Ki Sense",
      "Dual Destructo-Disc",
      "Explosive Wave",
      "Energy Cannon",
      "Infinity Bullet",
      "Sadistic 18",
      "Arm Breaker",
      "Power Blitz"
    ],
    "fighting_style": "Android 18 is extremely powerful, able to easily overpower even the typical Super Saiyan. Android 18's power is described to be suppressed compared to her brother, Android 17. Her raw strength is able to casually break free from confines like handcuffs and just as effortlessly lift and toss large vehicles. Her most noteworthy and beneficial trait in battle is her continuous and virtually infinite energy supply, which prevents her from becoming exhausted while also augmenting her attacks. Despite her body being modified enough to be labeled an android, she is still completely organic, and a human-based model, she can still grow in skills and power level through training. At the same time, her amplified physiology makes her cells deteriorate much slower due to, enabling her to keep up her peak nature without training while still able to grow stronger through also vastly extending her youth and longevity. She also requires no nourishment beyond water."
  },
  {
   "name": "Android 17",
   "image": "android17-main1.png",
   "summary": "Android 17 (人造じんぞう人間にんげん１７号ごう Jinzōningen Jū Nana-Gō, lit. Artificial Human No. 17), Lapis (ラピス Rapisu) when he was an ordinary human, is the twin brother of Android 18 and Dr. Gero's seventeenth android creation, designed to serve Gero's vendetta against Goku.",
   "rank": "450,000,000 - 900,000,000 power level",
   "rank_url": "https://dragonball.fandom.com/wiki/User_blog:SpikeFuture/All_Dragon_Ball_Power_Levels",
   "moves": [
      "False Self Destruction ",
      "Flight",
      "Energy Attack",
      "Ki Sense",
      "Endgame",
      "Flip Cyclone",
      "Kiai",
      "Super Electric Strike",
      "Electric Shot"
    ],
   "fighting_style": "Due to the bio-mechanical and cybernetic enhancements Dr. Gero gave him, including an unlimited supply of energy that grants him limitless stamina and an accelerated recovery rate, he has power well-surpassing the standard capacity of Super Saiyan. He was also powerful enough to easily murder his modified creator, Dr. Gero, in three blows."
  },
  {
   "name": "Krillin",
   "image": "krillin.png",
   "summary": "Krillin (クリリン Kuririn) is a supporting protagonist in the Dragon Ball franchise. Krillin had a brief rivalry with Goku when they first met and trained under Master Roshi, but they quickly became lifelong best friends.[9] One of the most powerful and talented martial artists on Earth, Krillin is courageous, faithful, and good-natured. He is a prominent Z Fighter, despite usually being overpowered by the major enemies.",
   "rank": "7,000,000 - 38,000,000 power level",
   "rank_url": "https://dragonball.fandom.com/wiki/User_blog:SpikeFuture/All_Dragon_Ball_Power_Levels",
   "moves": [
    "Flight",
    "Ki Blast",
    "Kamehameha",
    "Destructo Disc",
    "Solar Flare",
    "Afterimage Technique",
    "Double Tsuibikidan"
  ],
  "fighting_style": "Despite being regarded as a weakling compared to his Saiyan comrades, in truth, he is the strongest Earthling warrior. In addition, combined with his own battle tactics make him a skilled fighter. Due to him being portrayed often as a comic relief character by the latter half of Dragon Ball Z, his true power is never really seen. When the time counts, however, he can catch opponents more powerful than him off guard. His fighting style also employs misdirection, giving him a further advantage."
  },
  {
   "name": "Frieza",
   "image": "frieza.png",
   "summary": "Frieza (フリーザ Furīza) is the emperor of Universe 7, who controlled his own imperialist army and is feared for his ruthlessness and power. He is the descendant of Chilled, the second son of King Cold, the younger brother of Cooler, and the father of Kuriza. Frieza is the main antagonist of the entire franchise as his actions led to multiple conflicts and is even considered Goku's greatest foe and arch nemesis.",
   "rank": "120,000,000 - 50,000,000,000 power level",
   "rank_url": "https://dragonball.fandom.com/wiki/User_blog:SpikeFuture/All_Dragon_Ball_Power_Levels",
   "moves": [
     "Death Beam",
     "Death Ball",
     "Death Cannon",
     "Death Saucer",
     "Nova Strike",
     "Psychokinesis",
     "Flight"
   ],
   "fighting_style": "Frieza is one of the most powerful mortal warriors in Universe 7 and the multiverse as a whole. He was born a mutant with abnormally great power in comparison to the rest of his race. Even though the rest of his family are strong, Frieza has always been in a completely different league. The intensity of Frieza's power, even at his weakest, can effortlessly destroy entire planets. Upon hearing that Frieza was defeated, the God of Destruction Beerus was shocked that this was possible (by anyone besides himself). He is also recognized as a prodigy of such innate talent and natural growth that he became known as the most powerful warrior in the universe with no real training or proper fighting style. Even more, his mutant genes seem to let him grow in strength in a far shorter period than most. After training for the first time in his life, with only four months of training, he shattered his previous limitations and quickly adjusted to his newfound power, developing a state on the level of gods, a feat all the more impressive considering he did so with virtually no help."
 },
  {
   "name": "Cell",
   "image": "cell.png",
   "summary": "Cell (セル Seru) is the ultimate creation of Dr. Gero, designed via cell recombination[1] using the genetics of the greatest fighters that the remote tracking device could find on Earth. The result was a perfect warrior, possessing numerous favorable genetic traits and special abilities from Goku, Vegeta, Piccolo, Frieza and King Cold. He was one of the few Red Ribbon Androids not directly completed by Dr. Gero, instead being completed by Dr. Gero's Supercomputer in an alternate timeline. He is the main antagonist of the Imperfect Cell, Perfect Cell, and Cell Games Sagas.",
   "rank": "3,500,000,000 - 180,000,000,000 power level",
   "rank_url": "https://dragonball.fandom.com/wiki/User_blog:SpikeFuture/All_Dragon_Ball_Power_Levels",
   "moves": [
     "Eye Laser",
     "Kamehameha",
     "Saiyan Power",
     "Ki Blast",
     "Flight",
     "Mouth Energy Wave",
     "Ultimate Blitz",
     "Death Beam",
     "Spirit Bomb",
     "Absorption",
     "Regeneration",
     "Solar Flare",
     "Birthing Cell Juniors",
     "Multi Form"
   ],
   "fighting_style": "In his Imperfect Form, Cell has the power of his genetic materials at the time their DNA had been collected. Perfect Cell becomes far stronger still, with Moori in the anime speculating that he was powerful enough to threaten the entire Universe. In his Super Perfect form, Cell seems to be comparable in strength to Super Saiyan 2 Gohan."
  },
  {
   "name": "Majin Buu",
   "image": "buu.png",
   "summary": "Majin Buu (魔ま人じんブウ Majin Bū, lit. Demon Person Boo) has many forms. However, each form has a different personality and goals, essentially making them separate individuals. All of Majin Buu's forms are simply referred to as Majin Buu in the series, but the various forms get their common names from various Dragon Ball Z video games. We will consider Super Buu here for the purposes of this match up.",
   "rank": "125,000,000,000 - 5,100,000,000,000 power level",
   "rank_url": "https://dragonball.fandom.com/wiki/User_blog:SpikeFuture/All_Dragon_Ball_Power_Levels",
   "moves": [
     "Absorption",
     "Body Manipulation",
     "Regeneration",
     "Unique Interior Body",
     "Human Extinction Attack",
     "Ill Rain",
     "Antenna Beam",
     "Transfiguration Beam",
     "Magic Materialization",
     "Vice Shout",
     "Wrap Attack",
     "Kamehameha",
     "Special Beam Cannon",
     "Galactic Donut",
     "Super Ghost Kamikaze Attack",
     "Eye Lasers"
   ],
   "fighting_style": "Super Buu (超ブウ Chō Bū), also called Majin Buu (Evil) (魔ま人じんブウ（悪あく） Majin Bū (Aku)), is the result of Evil Buu eating Good Buu in a chocolate form. This new Majin Buu has tremendously more power and increased mental capacity than the previous incarnation. In this form, Buu has very little patience and extremely dangerous fits of anger, even possessing the power to rip through dimensional walls if angered enough. Super Buu is essentially the same entity as the fat Majin Buu, but with the evil in control instead of the good, as such he is not as restrained as the fat Buu and has access to the power of the South Supreme Kai. Super Buu can increase his power via absorptions."
  },
  {
   "name": "Piccolo",
   "image": "piccolo.png",
   "summary": "Piccolo Jr. (ピッコロ・ジュニア Pikkoro Junia, lit. Piccolo Junior), usually just called Piccolo or Kamiccolo and also known as Ma Junior (マジュニア Majunia), is a Namekian and also the final child and reincarnation of King Piccolo, later becoming the reunification of the Nameless Namekian after fusing with Kami. According to Grand Elder Guru, Piccolo, along with Kami and King Piccolo, are part of the Dragon Clan, who were the original creators of the Dragon Balls. A wise and cunning warrior, he was the main antagonist in the final saga of Dragon Ball, the Piccolo Jr. Saga, and was thus a ruthless enemy of Goku. However, starting with the first saga of Dragon Ball Z, the Raditz Saga, he began to lose all villainous traits, and when he started training Goku's son Gohan during the Vegeta Saga which led to the two developing a strong bond with each other, he became a permanent member of the Dragon Team and eventually one of Earth's greatest heroes.",
   "rank": "900,000,000 - 17,000,000,000 power level",
   "rank_url": "https://dragonball.fandom.com/wiki/User_blog:SpikeFuture/All_Dragon_Ball_Power_Levels#Piccolo_Jr._Saga",
   "moves": [
     "Special Beam Cannon",
     "Regeneration",
     "Explosive Demon Wave",
     "Demon Hand",
     "Masenko",
     "Hellzone Grenade",
     "Multi-Form",
     "Evil Containment Wave",
     "Self Destruction"
   ],
   "fighting_style": "Piccolo is the most powerful Namekian in Universe 7 and Universe 6, with Grand Elder Guru remarking him (or rather his original self the Nameless Namekian) to be a prodigy amongst prodigies, and even strong enough to stand up to Super Saiyans. Piccolo has been the strongest Z Fighter in the series at two points: when he fuses with Nail to battle Frieza and after he fuses with Kami to become the Nameless Namekian again in order to combat the Androids. Through the rest of the series, he has tended to rank in power below Goku and Vegeta but above Tien and Krillin. His special techniques often allow him to damage opponents with raw power higher than his own by concentrating it into a single attack, most notably the Special Beam Cannon."
  },
  {
   "name": "Goku Black / Zamasu",
   "image": "black.png",
   "summary": "Goku Black (ゴクウブラック Gokū Burakku), usually referred to as Black, is the main antagonist of the Future Trunks Saga of Dragon Ball Super. His true identity is Zamasu (ザマス Zamasu) from the unaltered main timeline within Universe 10. He is a former North Kai and Supreme Kai apprentice serving his former master Gowasu. Goku Black visited Universe 6, went to the Super Dragon Balls from the unaltered main timeline within that universe, summoned Super Shenron from said timeline, wished to switch bodies with Goku from the unaltered main timeline within Universe 7, and Super Shenron granted Goku Black's wish. Goku Black sought to destroy all mortals alongside Future Zamasu.",
   "rank": "Divine Super Saiyan Rosé",
   "rank_url": "https://dragonball.fandom.com/wiki/Super_Saiyan_Ros%C3%A9",
   "moves": [
     "Black Power Ball",
     "Divine Retribution",
     "Black Kamehameha",
     "Sudden Death Beam",
     "God Split Cut",
     "Violent Fierce God Slicer",
     "Immortality",
     "Spirit Bomb",
     "Mimicry",
     "Instant Transmission",
     "Telekinesis",
     "Thunder Shock Surprise",
     "Saiyan Power"
   ],
   "fighting_style": "Before switching bodies with Goku, Zamasu was already a fighting prodigy and easily the strongest Kai to ever live, he was also capable of moving the planet-sized Super Dragon Balls. After stealing Goku's body and gaining the Saiyan's might and abilities while in unison retaining his Supreme Kai powers, his skills and power greatly increased, repeatedly proving to be a highly dangerous opponent. Immediately after taking Goku's body (having not even unlocked the ability to become a Super Saiyan) he is able to kill Goku in Zamasu's body."
  },
  {
   "name": "Future Trunks",
   "image": "trunks.png",
   "summary": "Future Trunks (未み来らいのトランクス Mirai no Torankusu) is the Saiyan and Earthling hybrid son of Vegeta and Bulma from an alternate future. By the time Present Trunks was born, the timeline had been altered by Future Trunks' and Cell's trips to the past. Therefore, the two Trunks had completely different lives (as opposed to those who lived before the Time Machines arrived, who lived exactly the same lives as their counterparts until the point at which the two timelines diverge, three years before the androids arrived).",
   "rank": "B Class",
   "rank_url": "https://yuyuhakusho.fandom.com/wiki/B_Class",
   "moves": [
     "Burning Attack",
     "God Breaker",
     "Saiyan Power",
     "Continuous Energy Bullet",
     "Burning Storm",
     "Solar Flare",
     "Deadly Impact",
     "Shining Sword Attack",
     "Masenko",
     "Final Flash",
     "Final Explosion",
     "Galick Gun",
     "Evil Containment Wave"
   ],
   "fighting_style": "In the manga, during his early days of training, even as a Super Saiyan, Future Trunks was unable to defeat base Future Gohan. Right before Future Trunks heads back to warn the Z Fighters of the Android threat, it is said by Future Bulma that he has become as strong as Future Gohan was. When Future Trunks first appears on-screen, using his Super Saiyan form, he is able to easily overpower both Mecha Frieza and King Cold. Gohan describes Super Saiyan Future Trunks as having as large a ki as Super Saiyan Goku had on Namek. Future Trunks trains with Vegeta in the Hyperbolic Time Chamber and they increase in power enough to become the only two Z Fighters capable of holding their own in a fight with a Cell Jr., using their Super Saiyan forms instead of the advanced states they previously used. However, Cell himself states that neither Future Trunks or Vegeta compare to Super Saiyan Full Power Goku at his full strength. By the time Future Trunks goes back to the future, he is strong enough in Super Saiyan form to easily destroy Future Android 18, Future Android 17, and Future Imperfect Cell."
  }
 ]
}
