{
 "characters": [
   {
    "name": "Gon Freeccss",
    "summary": "Gon Freecss (ゴン゠フリークス, Gon Furīkusu) is a Rookie Hunter and the son of Ging Freecss. Finding his father is Gon's motivation in becoming a Hunter. He has been the main protagonist for most of the series, having said role in the Hunter Exam, Zoldyck Family, Heavens Arena, Greed Island, and Chimera Ant arcs.",
    "rank": "Nen Enhancer",
    "rank_url": "https://hunterxhunter.fandom.com/wiki/Nen#Enhancement",
    "moves": [
      "Nen Abilities: Jajanken(Rock, Paper, Scissors), Limitation Transformation",
      "Enhanced Vision",
      "Enhanced Hearing",
      "Preternatural Perception",
      "Enhanced Strength",
      "Enhanced Speed and Reflexes",
      "Enhanced Agility",
      "Enhanced Stamina and Endurance",
      "Advanced Poison Resistance",
      "Quick Healing"
     ],
     "fighting_style": "Together with his potential, it is his strength of mind that continuously leaves more experienced and skilled fighters dumbstruck, and is a crucial component of his overflowing charisma that causes even more powerful Hunters to gravitate towards him. His indomitable will allows him to continuously put his life on the line without being held back by fear, which in turn allows him to take chances others would never dare. As an Enhancer, he should be fairly balanced between offense and defense, but he prefers to go on the offensive, as his stubbornness tends to come out during combat. Because of it, he sometimes charges in recklessly, but at the same time doesn't give up until he can't move anymore. He is quite proficient in close combat after being trained in the basics of Shingen-ryu kung fu by Wing and Biscuit, as well as through natural experience. Although this quality often goes unnoticed, Gon can focus intensely even in the direst circumstances, noticing details even starred Hunters would miss. Other abilities include sleeping with a larger part of his brain awake than normal, thanks to Biscuit's training, and holding his breath for some minutes even if fatigued."
   },
   {
    "name": "Killua Zoldyck",
      "summary": "Killua Zoldyck (キルア゠ゾルディック, Kirua Zorudikku) is the third child of Silva and Kikyo Zoldyck and the heir of the Zoldyck Family, until he runs away from home and becomes a Rookie Hunter. He is the best friend of Gon Freecss and is currently traveling with Alluka Zoldyck.",
      "rank": "Nen Transmuter",
      "rank_url": "https://hunterxhunter.fandom.com/wiki/Nen#Transmutation",
      "moves": [
         "Nen Abilities: Lightning Palm, Godspeed, Whirlwind, Thunderbolt",
         "Assassin Mode",
         "Preternatural Perception",
         "Enhanced Strength",
         "Immense Speed and Reflexes",
         "Enhanced Stamina and Durability",
         "Resistance to Electricity",
         "Immense Poison Resistance",
         "Master Weapon Specialist",
         "The Snake Awakens",
         "Rhythm Echo"
       ],
      "fighting_style": "Killua has been trained since birth to become a human weapon and is recognized by his family to be the most talented assassin in the entire history of the Zoldycks.[8] When he took the Hunter Exam the first time, he was the fourth most powerful applicant (after Gittarackur, and, by his own admission, Hisoka and Hanzo, although the latter was without entering his assassin mode), and the one that Satotz believed would pass. Up until the Hunter Exam, he did not hesitate a second to kill, but after meeting Gon, this tendency subsided; still, he is not afraid to resort to extreme means when circumstances demand it. As a Transmuter, Killua's most efficient in changing the properties and shape of his aura. Just like Gon's, Killua's talent is said to be absolutely astounding, found only in one out of ten million people.Thanks to Biscuit's training he has honed his skills in at least two Nen types other than his own, namely Enhancement and Conjuration. He has also mastered the four basic techniques and at least five of the advanced ones (the exceptions being possibly In and En, although he is able to extend his Ren to a radius of 57 cm to sense incoming attacks). He performed Ten successfully on the first try with next to no instructions, a feat which Wing described as both amazing and terrifying, and learned Ren and Gyo in only one night. Killua developed a series of Nen abilities in which he alters the properties of his aura to make it similar to electricity. This was inspired and made possible by the years of electric shocks he received as a child, both as training against torture and as punishment."
     },
     {
      "name": "Leorio",
      "summary": "Leorio Paradinight (レオリオ゠パラディナｲﾄ, Reorio Paradinaito) is a Rookie Hunter and a member of the Zodiacs with the codename Boar (亥い, I). He is currently a medical student, with a goal to become a doctor.",
      "rank": "Nen Emitter",
      "rank_url": "https://hunterxhunter.fandom.com/wiki/Nen#Emission",
      "moves": [
         "Nen Ability: Remote Punch",
         "Preternatural Perception",
         "Enhanced Strength",
         "Enhanced Speed and Reflexes",
         "Weapon Specialist",
         "Advanced Agility and Stamina"
       ],
      "fighting_style": "Due to postponing his training due to applying to university, by the time he met Gon and Killua in Yorknew City, he could use only Ten and was unaware of the existence of other techniques. He may have learned Zetsu in one day, since he managed to sneak up on Kurapika. However, during the 13th Chairman Election, Leorio was shown to have improved greatly, having developed at least one Nen ability. According to Ging, he might also possess another which earned him the praise of one of the most skilled Nen users in the world. Ging reckons Leorio's Nen ability was heavily influenced by his studies in medicine."
     },
     {
      "name": "Kurapika",
      "summary": "Kurapika (クラピカ, Kurapika) is the last survivor of the Kurta Clan. He is a Blacklist Hunter and the current leader of the organization founded by Light Nostrade. He is a member of the Zodiacs with the codename Rat (子ね, Ne). His goal is to avenge his clan and recover the remaining Scarlet Eyes. He takes the role of the main protagonist in the Yorknew City and Succession Contest arcs.",
      "rank": "Nen Conjurer",
      "rank_url": "https://hunterxhunter.fandom.com/wiki/Nen#Conjuration",
      "moves": [
         "Nen Ability: Dowsing Chain, Chain Jail, Emperor Time, Holy Chain, Judgment Chain, Steal Chain, Stealth Dolphin",
         "Enhanced Strength",
         "Enhanced Speed and Reflexes",
         "Master Strategist",
         "Preternatural Perception",
         "Scarlet Eyes",
         "Advanced Hearing",
         "Proficient Hand-to-Hand Combatant"
       ],
      "fighting_style": "Although at the beginning he was weaker than Killua, during the Yorknew City arc he had become stronger than him due to his Nen abilities. He is one of the few characters (the others being Hisoka and Silva) to have killed a member of the infamous Phantom Troupe, and a very potent one. His exceptional intelligence is matched by high combat prowess and iron will that stems from his desire for revenge. He is also very versatile as he has been seen wielding different weapons. In his showdown with Uvogin, he used his chains when afar and at close quarter combat. While he usually maintains a calm and collected persona, he tends to lose his cool whenever the Phantom Troupe or his clan, are nominated, often turning violent."
     },
     {
      "name": "Isaac Netero",
      "summary": "Isaac Netero (アイザック゠ネテロ, Aizakku Netero) was the 12th Chairman of the Hunter Association and the Head of the Exam Commission. In his youth, he was extolled as the most powerful Nen user in the world, and retained dreadful strength even in his old age.",
      "rank": "Nen Enhancer",
      "rank_url": "https://hunterxhunter.fandom.com/wiki/Nen#Enhancement",
      "moves": [
         "Nen Ability: 100-Type Guanyin Bodhisattva, Zero Hand, First Hand, Third Hand, Ninety-Ninth Hand",
         "Immense Stamina and Agility",
         "Immense Endurance",
         "Immense Strength",
         "Unfathomable Speed and Reflexes",
         "Muscle Control",
         "Master Hand-to-Hand Combatant"
       ],
      "fighting_style": "Netero is an extremely powerful practitioner of Nen, holding the title of the most powerful Nen master in his prime. Although Morel keeps regarding him as unmatched within the Hunter Association, and Knov acknowledged he is still far above the two of them, Netero stated that his time at the top has passed. Despite being an Enhancer, Netero's most dangerous Nen ability draws on at least two other Nen types: Manipulation and either Emission or Conjuration, with the probable inclusion of Transmutation as well, at least in his strongest technique. Although the survival rate of the official expeditions to the Dark Continent is a mere 0.04%, Netero set foot on it twice and returned alive with no signs of lasting injury both times. Even in his old age, Netero remains extremely powerful, with Morel asserting that if Netero cannot defeat an opponent, then no one in the entire Hunter Association can. "
     },
     {
      "name": "Meruem",
      "summary": "Meruem (メルエム, Meruemu) was the most powerful offspring of the Chimera Ant Queen. He was known as the King (王おう, Ō) of the Chimera Ants, and served as the main antagonist of the Chimera Ant arc.",
      "rank": "Nen Specialist",
      "rank_url": "https://hunterxhunter.fandom.com/wiki/Nen#Specialization",
      "moves": [
         "Nen Abilities: Aura Synthesis, Metamorphosis, Rage Blast, Photon",
         "Unfathomable Strength",
         "Unfathomable Speed and Reflexes",
         "Unfathomable Agility",
         "Immense Stamina",
         "Unfathomable Durability",
         "Immense Pain Tolerance",
         "Immense Poison Resistance",
         "Supergenius-Level Intellect",
         "Proficient Hand-to-Hand Combatant"
       ],
      "fighting_style": "Meruem is a Specialist. He was born with the ability to use Nen and a vastly superhuman amount of aura, which exceeded even that of the Royal Guards. By feeding on Nen users, he increased the size of his aura even further. After consuming Shaiapouf and Menthuthuyoupi, his aura reserves and output became such that even the overly protective Royal Guards had to admit the King seemed invincible and capable of winning a Nen battle through the sheer quantity of one's aura. Upon sensing his Ren, the Extermination Team members despaired, with Knuckle believing they would need the military power of a whole country to defeat the King. He could perform Gyo shortly after birth without receiving instructions. His Ren struck fear even in Netero's heart, and allowed Meruem to pry open the hands of 100-Type Guanyin Bodhisattva as well as to emerge from Third Hand completely unscathed, whereas Netero's First Hand had previously caused him to spit blood. This defensive application of Ren may imply he is capable of Ken."
     },
     {
      "name": "Neferpitou",
      "summary": "Neferpitou (ネフェルピトー, Neferupitō), nicknamed Pitou (ピトー, Pitō), was a cat-humanoid Chimera Ant and the firstborn of the Chimera Ant King's three Royal Guards.",
      "rank": "Nen Specialist",
      "rank_url": "https://hunterxhunter.fandom.com/wiki/Nen#Specialization",
      "moves": [
         "Nen Abilities: Doctor Blythe, Puppeteering, Terpsichora",
         "Immense Vision",
         "Immense Hearing",
         "Immense Smell",
         "Immense Strength",
         "Immense Speed and Reflexes",
         "Immense Stamina and Agility",
         "Immense Intuition"
       ],
      "fighting_style": "Neferpitou is a Specialist. They were born with the innate ability to control their Aura Nodes, as well as with an unfathomable amount of aura and a learning speed far exceeding a human's, so they could use En hours after their birth and create Nen abilities on a whim. n fact, their aura appears tremendously ominous to Nen users even when Neferpitou is not giving off hostility, which can act as a powerful deterrent. Their aura is so abundant that they can keep their immense En and puppets active for days on end and not get tired in the very least. Their En is singularly vast. It is irregularly shaped: rather than a sphere, it takes the form of tendrils, a single one of which can be extended up to two kilometers in length. They can bend its shape at will. Despite the process of creating a Nen ability being notoriously long and difficult, Neferpitou successfully performed a surgery with Doctor Blythe just by imagining how to bring Kite back to life in order to fight him again. As one of the three members of the Royal Guard, Neferpitou is one of the most powerful Chimera Ants to live, and one of the strongest characters in the series. They fought and killed Kite, a powerful Pro Hunter, while suffering only minor injuries, and shortly after discovering Nen.[6] Illumi referred to Neferpitou as Meruem's top soldier. Despite intending to kill them, the King was only able to bruise Neferpitou with one of his tail strikes, which caused him to praise the Royal Guard."
     },
     {
      "name": "Shaiapouf",
      "summary": "Shaiapouf (シャウアプフ, Shauapufu), nicknamed Pouf (プフ, Pufu), was a butterfly-humanoid Chimera Ant and one of the Chimera Ant King's Royal Guards.",
      "rank": "Nen Manipulator",
      "rank_url": "https://hunterxhunter.fandom.com/wiki/Nen#Manipulation",
      "moves": [
         "Nen Abilities: Cocoon, Spiritual Message, Beelzebub, Body Reconstruction",
         "Flight",
         "Enhanced Strength",
         "Immense Speed",
         "Immense Stamina",
         "Master Strategist",
         "Empathic Bond"
       ],
      "fighting_style": "Shaiapouf's Nen abilities are focused on support and indirect strategies, encompassing a wide range of uses that contributed considerably to the King's military power by creating an army of loyal Nen users. His instinctive knowledge of Nen is so deep that he can bestow Nen abilities on other Chimera Ants that complement their natural abilities and characters. Aside from Hatsu, Shaiapouf is capable of using En, which presupposes knowledge of Ten and Ren, although by his own admission it cannot compare to Neferpitou's. Nonetheless, it has a range of several meters and he can maintain it for a couple of hours without effort. Much like Neferpitou's, it seems to be amorphous. Shaiapouf also used Ken or Ren to increase his flying speed. Despite the boost, however, he is not as fast as Killua with Godspeed, not even at full power. Since he attempted to ambush Gon, he might also be able to use Zetsu or In, although he was not skilled enough to avoid detection."
     },
     {
      "name": "Hisoka",
      "summary": "Hisoka Morow (ヒソカ゠モロウ, Hisoka Morou) is a Hunter and former member #4 of the Phantom Troupe; his physical strength ranked third in the group. He is always in search for strong opponents, and would spare those who have great potential, such as Gon and Killua in order for them to get strong enough to actually challenge him. He originally served as the primary antagonist of the Hunter Exam arc and a secondary one of the Heavens Arena arc, before becoming a supporting character during the Yorknew City arc and Greed Island arc. During the 13th Hunter Chairman Election arc, he briefly reprises his role as a secondary antagonist.",
      "rank": "Nen Transmuter",
      "rank_url": "https://hunterxhunter.fandom.com/wiki/Nen#Transmutation",
      "moves": [
         "Nen Abilities: Bungee Gum, Texture Surprise",
         "Immense Strength",
         "Preternatural Perception",
         "Enhanced Speed and Reflexes",
         "Enhanced Stamina and Agility",
         "Immense Endurance",
         "Master Strategist",
         "Master Hand-to-Hand Combatant",
         "Master Weapon Specialist",
         "Master of Stealth"
       ],
      "fighting_style": "Hisoka is a Transmuter endowed with a powerful, sinister aura. He manifests his high level of proficiency in his natural category primarily through his Nen ability, Bungee Gum, but he has also shown to be very proficient at controlling the shape of his aura, which is a Transmutation skill. This aptitude may be what allows him to extend strands of elastic aura over distances of several meters without flinging them, which makes its application more subtle. He is also well-versed in Conjuration, the Nen type of his second ability, as well as Emission and, seemingly, Enhancement. He utilizes the former to maintain aura around projectiles as well as in conjunction with Bungee Gum, to separate the ability from his body. His affinity for Enhancement manifests primarily as a remarkable level of durability. Hisoka survived multiple Nen-enhanced strikes from Kastro, an Enhancer, without using his aura to defend. Although he was briefly stunned, Hisoka took no visible damage from most of Chrollo's attacks, one of which can allegedly behead a person with a knife-hand strike, despite Hisoka having been unable to predict them and thus to guard properly."
     },
     {
      "name": "Illumi Zoldyck",
      "summary": "Illumi Zoldyck (イルミ゠ゾルディック, Irumi Zorudikku) is the eldest child of Silva and Kikyo Zoldyck. During the 287th Hunter Exam, he appeared under the guise of Gittarackur (ギタラクル, Gitarakuru). At Hisoka's request, Illumi joins the Phantom Troupe as Uvogin's replacement, becoming Troupe member #11. He served as a secondary antagonist of the Hunter Exam arc and the primary one of the 13th Hunter Chairman Election arc.",
      "rank": "Nen Manipulator",
      "rank_url": "https://hunterxhunter.fandom.com/wiki/Nen#Manipulation",
      "moves": [
        "Nen Abilities: Body Alteration, Hypnotic Spell, Corpse Control, Needle People",
         "Enhanced Speed",
         "Advanced Stamina",
         "Immense Pain Tolerance",
         "Master Thrower",
         "Jagan Eye",
         "Dragon of the Darkness Flame",
         "Fist of the Mortal Flame",
         "Sword of the Darkness Flame",
         "Dragon Absorption"
       ],
      "fighting_style": "Illumi is a Manipulator and has an incredibly sinister Ren which can at least be felt from a distance of several hundred meters. His aura is so powerful that, if injected into a normal person, it will cripple them for life. His Nen abilities allow him to change his physical appearance, control the dead and the living alike with overpowering mind and body control, and influence others with subtler types of Manipulation, a range of applications that suggests a great mastery over this Nen category. Thanks to his training, he possesses rare abilities such as strong resistance to poison, high tolerance to electricity, great agility and physical strength, and advanced armed and unarmed combat techniques. He was able to single-handedly wipe out a squadron of more than 20 amateur Hunters without any of them managing to press the emergency button. He might have superhuman control over his body, as he told Hisoka he was going to sleep for five days. Illumi is also a very skilled impersonator, and he seems to be able to conceal his strength and other aspects that might give him away when disguised."
     },
     {
      "name": "Bisky",
      "summary": "Biscuit Krueger (ビスケット゠クルーガー, Bisuketto Kurūgā) is a Double-Star Stone Hunter who was hired by Battera to clear the video game Greed Island following the auction for the game in Yorknew City. She prefers to be called Bisky (ビスケ, Bisuke). After passing the Hunter Exam at some unknown point, she served as an examiner herself.",
      "rank": "Nen Transmuter",
      "rank_url": "https://hunterxhunter.fandom.com/wiki/Nen#Transmutation",
      "moves": [
         "Nen Abilities: Magical Esthetician, Piano Massage, Body Transformation",
         "Immense Strength",
         "Preternatural Perception",
         "Immense Speed and Reflexes",
         "Enhanced Stamina",
         "Master Hand-to-Hand Combatant"
       ],
      "fighting_style": "Biscuit is a Transmuter who also appears to be proficient in Emission, Enhancement, and Manipulation, despite the latter Nen type being the hardest for Transmuters to master.Her main Nen ability seems to combine Transmutation, Manipulation, and either Emission or Conjuration. She has developed exercises that allow her students to train in all five accessible categories, which should suggest that she has acquired a high level of skill in all of them, especially given her habit of demonstrating the exercises herself. Biscuit is an incredibly skilled and powerful fighter. Through gruesome training, she was able to reach the peak of her physical potential. Out of all the participants in Razor's dodgeball match, she was the only one to emerge completely uninjured, despite playing in her younger form. She has yet to show any offensive-oriented special abilities, as the combination of her extensive knowledge in Nen, honed body, and martial artistry have been enough to dispatch all her opponents thus far. Her full power is also unknown, but she managed to defeat troublesome opponents such as Binolt and Bara single-handedly, with them growing terrified at her true power, which even in her younger form she is rather adept at concealing. Even Killua dreads her strength. Aside from her combat skills, she is also endowed with a bright intellect and a fair amount of experience owed to her age."
     },
     {
      "name": "Chrollo",
      "summary": "Chrollo Lucilfer (クロロ゠ルシルフル, Kuroro Rushirufuru) is the founder, leader, and member #0 of the Phantom Troupe, an infamous gang of thieves with class-A bounties. His physical strength ranks seventh in the group.",
      "rank": "Nen Specialist",
      "rank_url": "https://hunterxhunter.fandom.com/wiki/Nen#Specialization",
      "moves": [
         "Nen Abilities: Skill Hunter, Double Face, Indoor Fish, Fun Fun Cloth, Teleportation, Black Voice, The Sun and Moon, Order Stamp, Gallery Fake, Convert Hands",
         "Enhanced Strength",
         "Immense Speed and Reflexes",
         "Preternatural Perception",
         "Master Strategist",
         "Master Hand-to-Hand Combatant",
         "Proficient Weapon Specialist"
       ],
      "fighting_style": "Chrollo is a Specialist; his Nen type is a combination of the other five, but in a way that no normal Nen user can utilize. His talent for Nen is judged prodigious not only for his age but even by the standards of masters in the discipline. His Zetsu was noted by Silva to be flawless, allowing him to sneak up on his opponent and kill them without leaving the faintest trace of bloodlust. Chrollo is an exceptional fighter, being the leader of the Phantom Troupe and revered as the strongest member by most of them. Machi ranks him cleanly above Hisoka,[48] who has consistently shown to prize a fight with the Phantom Troupe's leader far more than against any other Spider. However, he tends to hold back if his opponent owns an ability that interests him so that he can steal it. He was able to fight against Silva and Zeno Zoldyck, both extremely proficient assassins, simultaneously, without leaving any openings for the former to exploit. His fighting style is adaptable and combines speed with deadly precision. He is able to kill skilled hitmen with just a pen, sometimes even remaining concealed with Zetsu,[24] thus without the use of Nen. Chrollo is also endowed with terrific strategic abilities as well as astounding strength of mind and willpower, even by the standards of the Troupe."
     },
     {
      "name": "Pakunoda",
      "summary": "Pakunoda (パクノダ, Pakunoda) was member #9 or #6 of the Phantom Troupe, an infamous gang of thieves with class-A bounties. Her physical strength ranked eleventh in the group.",
      "rank": "Nen Specialist",
      "rank_url": "https://hunterxhunter.fandom.com/wiki/Nen#Specialization",
      "moves": [
         "Nen Abilities: Psychometry, Memory Bomb",
         "Enhanced Strength",
         "Advanced Speed",
         "Enhanced Agility and Endurance",
         "Proficient Marksman",
         "Expert in Tailing"
       ],
      "fighting_style": "Pakunoda is a Specialist. Her Nen ability gives her the power to read other people's memories. She can find out the opponent's Nen ability or in situations requiring some form of extortion or blackmail and share information. Shalnark stated that Pakunoda's abilities are a rare breed. Aside from Hatsu, she can execute at least Ren and Zetsu, with which she pursued Gon and Killua unnoticed and of which she was hailed as a skilled user."
     }
  ]
}
